# DeleteHydraulicSeparation Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipingSystem..::..DeleteHydraulicSeparation Method
PipingSystem Class See Also
---
Deletes hydraulically separated systems and merges the system components into the connected system.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public static void DeleteHydraulicSeparation(
	Document document,
	ISet<ElementId> pipeElementIds
)
```

Visual Basic
---
```text
Public Shared Sub DeleteHydraulicSeparation ( _
	document As Document, _
	pipeElementIds As ISet(Of ElementId) _
)
```

Visual C++
---
```text
public:
static void DeleteHydraulicSeparation(
	Document^ document,
	ISet<ElementId^>^ pipeElementIds
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document where the system is deleted.
pipeElementIds
    Type: System.Collections.Generic..::..ISet<(Of <(<'ElementId>)>)> The boundary pipe that separates the system. Multiple pipes are allowed to delete more than one separated systems.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | One or more elements is not a pipe. -or- One or more elements is not a valid loop boundary. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PipingSystem Class
Autodesk.Revit.DB.Plumbing Namespace